kauailabs/navxmxp/stm32/navx-mxp/navx-mxp_hal.c
void HAL_IOCX_TIMER_ConfigureInterruptPriorities(uint8_t timer_index) {
	if ( timer_index > (IOCX_NUM_TIMERS-1) ) return;
	int cc_irqn = timer_configs[timer_index].cc_irqn;
    HAL_NVIC_SetPriority(cc_irqn, 7, 0);
}

void HAL_IOCX_TIMER_Enable_Capture_Interrupt(uint8_t timer_index, int enable) {
	if ( timer_index > (IOCX_NUM_TIMERS-1) ) return;
	int cc_irqn = timer_configs[timer_index].cc_irqn;
	if (enable) {
		HAL_NVIC_EnableIRQ(cc_irqn);
	} else {
		HAL_NVIC_DisableIRQ(cc_irqn);
	}
}

void HAL_IOCX_TIMER_Set_Counter_Cfg(uint8_t timer_index, uint8_t config)
{
	if ( timer_index > (IOCX_NUM_TIMERS-1) ) return;
	timer_inputcap_configs[timer_index].clk_source = iocx_ex_timer_decode_counter_clk_src(&config);
	timer_inputcap_configs[timer_index].direction = iocx_ex_timer_decode_counter_direction(&config);
}

void HAL_IOCX_TIMER_Set_SlaveMode_Cfg(uint8_t timer_index, uint8_t config)
{
	if ( timer_index > (IOCX_NUM_TIMERS-1) ) return;
	timer_inputcap_configs[timer_index].slavemode = iocx_ex_timer_decode_slavemode(&config);
	timer_inputcap_configs[timer_index].slavemode_trigger = iocx_ex_timer_decode_slavemode_trigger_source(&config);
}

void HAL_IOCX_TIMER_INPUTCAP_Set_Cfg(uint8_t timer_index, uint8_t channel_index, uint8_t config)
{
	if ( timer_index > (IOCX_NUM_TIMERS-1) ) return;
	if ( channel_index > (IOCX_NUM_CHANNELS_PER_TIMER-1) ) return;
	timer_input_ch_configs[timer_index][channel_index].source = iocx_ex_timer_decode_ic_ch_src(&config);
	timer_input_ch_configs[timer_index][channel_index].active_edge = iocx_ex_timer_decode_ic_ch_active_edge(&config);
	timer_input_ch_configs[timer_index][channel_index].prescaler = iocx_ex_timer_decode_ic_ch_prescaler(&config);
}

void HAL_IOCX_TIMER_INPUTCAP_Set_Cfg2(uint8_t timer_index, uint8_t channel_index, uint8_t config)
{
	if ( timer_index > (IOCX_NUM_TIMERS-1) ) return;
	if ( channel_index > (IOCX_NUM_CHANNELS_PER_TIMER-1) ) return;
	timer_input_ch_configs[timer_index][channel_index].filter = iocx_ex_timer_decode_ic_ch_filter(&config);
}

void HAL_IOCX_TIMER_INPUTCAP_Set_StallCfg(uint8_t timer_index, uint8_t config)
{
	if ( timer_index > (IOCX_NUM_TIMERS-1) ) return;
	timer_inputcap_configs[timer_index].stall_timeout_ms = iocx_ex_timer_decode_ic_stall_timeout(&config) * TIMER_INPUT_CH_SHALL_TIMEOUT_UNIT_MS;
	timer_inputcap_configs[timer_index].stall_action = iocx_ex_timer_decode_ic_stall_action(&config);
}

static void HAL_IOCX_TIMER_ConfigureInputCaptureChannel(uint8_t timer_index, uint8_t channel_index, TIM_IC_InitTypeDef *psConfigIC)
{
	if ( timer_index > (IOCX_NUM_TIMERS-1) ) return;
	if ( channel_index > (IOCX_NUM_CHANNELS_PER_TIMER-1) ) return;

	/* Configure active edge(s) */
	switch (timer_input_ch_configs[timer_index][channel_index].active_edge) {
	case INPUT_CAPTURE_CH_ACTIVE_BOTH:
		psConfigIC->ICPolarity = TIM_INPUTCHANNELPOLARITY_BOTHEDGE;
		break;
	case INPUT_CAPTURE_CH_ACTIVE_FALLING:
		psConfigIC->ICPolarity = TIM_INPUTCHANNELPOLARITY_FALLING;
		break;
	case INPUT_CAPTURE_CH_ACTIVE_RISING:
	default:
		psConfigIC->ICPolarity = TIM_INPUTCHANNELPOLARITY_RISING;
		break;
	}

	/* Configure Capture Source */
	TIMER_INPUT_CAPTURE_CH_SOURCE input_src = timer_input_ch_configs[timer_index][channel_index].source;
	if (((channel_index == 0) && (input_src == INPUT_CAPTURE_FROM_SIGNAL_B))||
		((channel_index == 1) && (input_src == INPUT_CAPTURE_FROM_SIGNAL_A))) {
		psConfigIC->ICSelection = TIM_ICSELECTION_INDIRECTTI;
	} else {
		psConfigIC->ICSelection = TIM_ICSELECTION_DIRECTTI;
	}

	/* Configure Input Prescaler */
	switch (timer_input_ch_configs[timer_index][channel_index].prescaler) {
	case INPUT_CAPTURE_PRESCALE_8x:
		psConfigIC->ICPrescaler = TIM_ICPSC_DIV8;
		break;
	case INPUT_CAPTURE_PRESCALE_4x:
		psConfigIC->ICPrescaler = TIM_ICPSC_DIV4;
		break;
	case INPUT_CAPTURE_PRESCALE_2x:
		psConfigIC->ICPrescaler = TIM_ICPSC_DIV2;
		break;
	case INPUT_CAPTURE_PRESCALE_1x:
	default:
		psConfigIC->ICPrescaler = TIM_ICPSC_DIV1;
		break;
	}
	/* Configure Input Filter */
	psConfigIC->ICFilter = (uint32_t)timer_input_ch_configs[timer_index][channel_index].filter;
}

void HAL_IOCX_TIMER_Set_Config(uint8_t timer_index, uint8_t config)
{
	if ( timer_index > (IOCX_NUM_TIMERS-1) ) return;

	IOCX_TIMER_MODE mode = iocx_decode_timer_mode(&config);
	IOCX_QUAD_ENCODER_MODE qe_mode = iocx_decode_quad_encoder_mode(&config);

	if (mode != TIMER_MODE_QUAD_ENCODER) {
		ResetQEIntegrator(timer_index, 0 /* Disable */ );
	}

	switch(mode){
	case TIMER_MODE_DISABLED:
		HAL_IOCX_TIMER_Enable_Capture_Interrupt(timer_index,0);
		__HAL_TIM_DISABLE(timer_configs[timer_index].p_tim_handle);
		switch (iocx_decode_timer_mode(&curr_timer_cfg[timer_index])) {
		case TIMER_MODE_QUAD_ENCODER:
			HAL_TIM_Encoder_Stop(timer_configs[timer_index].p_tim_handle, BOTH_ENCODER_TIMER_CHANNELS);
			break;
		case TIMER_MODE_PWM_OUT:
			HAL_TIM_PWM_Stop(timer_configs[timer_index].p_tim_handle, timer_configs[timer_index].first_channel_number);
			HAL_TIM_PWM_Stop(timer_configs[timer_index].p_tim_handle, timer_configs[timer_index].second_channel_number);
			break;
		case TIMER_MODE_INPUT_CAPTURE:
		{
			HAL_TIM_IC_Stop_IT(timer_configs[timer_index].p_tim_handle, timer_configs[timer_index].first_channel_number);
			HAL_TIM_IC_Stop(timer_configs[timer_index].p_tim_handle, timer_configs[timer_index].second_channel_number);
			break;
		}
		default:
			break;
		}
		break;

	case TIMER_MODE_QUAD_ENCODER:
		{
			// Prescaler must be already set before enabling.
			TIM_Encoder_InitTypeDef sConfig;
			TIM_MasterConfigTypeDef sMasterConfig;

			TIM_HandleTypeDef * p_htim = timer_configs[timer_index].p_tim_handle;
			p_htim->Init.ClockDivision = timer_configs[timer_index].core_clock_divider;
			p_htim->Init.CounterMode = TIM_COUNTERMODE_UP;
			p_htim->Instance->ARR = timer_configs[timer_index].max_auto_reload_value;
			p_htim->Init.Period = p_htim->Instance->ARR;
			if (qe_mode == QUAD_ENCODER_MODE_4x) {
				// A & B signal, both edges
				sConfig.EncoderMode = TIM_ENCODERMODE_TI12;
			} else /* 1x or 2x */ {
				// A signal only.  Both edges are counted,
				// and if 1x the count is divided by two (later)
				sConfig.EncoderMode = TIM_ENCODERMODE_TI1;
			}
			qe_curr_mode[timer_index] = qe_mode;
			sConfig.IC1Prescaler = TIM_ICPSC_DIV1;
			sConfig.IC2Prescaler = TIM_ICPSC_DIV1;
			sConfig.IC1Polarity  = TIM_ICPOLARITY_RISING;
			sConfig.IC2Polarity  = TIM_ICPOLARITY_RISING;
			sConfig.IC1Selection = TIM_ICSELECTION_DIRECTTI;
			sConfig.IC2Selection = TIM_ICSELECTION_DIRECTTI;
			sConfig.IC1Filter    = (uint32_t)timer_input_ch_configs[timer_index][0].filter;
			sConfig.IC2Filter    = (uint32_t)timer_input_ch_configs[timer_index][1].filter;
			HAL_TIM_Encoder_Init(p_htim, &sConfig);

			/* Disable MasterSlave mode */
			sMasterConfig.MasterOutputTrigger = TIM_TRGO_RESET;
			sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
			HAL_TIMEx_MasterConfigSynchronization(p_htim, &sMasterConfig);

			/* Be sure to configure the auto-reload register (ARR) to the max possible value. */
			p_htim->Instance->ARR = timer_configs[timer_index].max_auto_reload_value;

