kauailabs/navxmxp/stm32/navx-mxp/navx-mxp_hal.c
			ResetQEIntegrator(timer_index, 1 /* Enable */);

			HAL_TIM_Encoder_Start(p_htim, BOTH_ENCODER_TIMER_CHANNELS);
		}
		break;

	case TIMER_MODE_PWM_OUT:
		{
			TIM_OC_InitTypeDef sConfigOC;
			TIM_HandleTypeDef * p_htim = timer_configs[timer_index].p_tim_handle;

			// Prescaler and Period must be already set before enabling.
			p_htim->Init.CounterMode = TIM_COUNTERMODE_UP;
			p_htim->Init.ClockDivision = timer_configs[timer_index].core_clock_divider;
			HAL_TIM_PWM_Init(p_htim);

			// Periods (CCR) for both channels must be already set before enabling.
			sConfigOC.OCMode = TIM_OCMODE_PWM1;
			sConfigOC.Pulse = timer_channel_ccr[timer_index][0];
			sConfigOC.OCPolarity = TIM_OCPOLARITY_HIGH;
			sConfigOC.OCFastMode = TIM_OCFAST_DISABLE;
			HAL_TIM_PWM_ConfigChannel(p_htim, &sConfigOC, timer_configs[timer_index].first_channel_number);
			sConfigOC.Pulse = timer_channel_ccr[timer_index][1];
			HAL_TIM_PWM_ConfigChannel(p_htim, &sConfigOC, timer_configs[timer_index].second_channel_number);

			HAL_TIM_PWM_Start(p_htim, timer_configs[timer_index].first_channel_number);
			HAL_TIM_PWM_Start(p_htim, timer_configs[timer_index].second_channel_number);
		}
		break;

	case TIMER_MODE_INPUT_CAPTURE:
		{
			// Inputcap, Inputcap channel settings must already be already set before enabling.
			// Prescaler must be already set before enabling.
			TIM_ClockConfigTypeDef sClockSourceConfig;
			TIM_SlaveConfigTypeDef sSlaveConfig;
			TIM_IC_InitTypeDef sConfigIC;
			TIM_MasterConfigTypeDef sMasterConfig;

			TIM_HandleTypeDef * p_htim = timer_configs[timer_index].p_tim_handle;

			switch (timer_inputcap_configs[timer_index].direction) {
			case TIMER_COUNTER_DIRECTION_DN:
				p_htim->Init.CounterMode = TIM_COUNTERMODE_DOWN;
				break;
			case TIMER_COUNTER_DIRECTION_UP:
			default:
				p_htim->Init.CounterMode = TIM_COUNTERMODE_UP;
				break;
			}
			p_htim->Init.Period = timer_configs[timer_index].max_auto_reload_value;
			p_htim->Init.ClockDivision = timer_configs[timer_index].core_clock_divider;
			p_htim->Init.RepetitionCounter = 0;

			HAL_TIM_IC_Init(p_htim);

			switch (timer_inputcap_configs[timer_index].clk_source) {
			case TIMER_COUNTER_CLK_INTERNAL:
				sClockSourceConfig.ClockSource = TIM_CLOCKSOURCE_INTERNAL;
				/* Note:  If internal clock is used, the maximum capture period is fixed. */
				/* max_period_ms = 1 * (65535 /(48000/HAL_IOCX_TIMER_Get_Normalized_Prescaler(timer_index)) */
				break;
			case TIMER_COUNTER_CLK_EDGEDETECT_CH1:
				sClockSourceConfig.ClockSource = TIM_CLOCKSOURCE_TI1ED;
				break;
			case TIMER_COUNTER_CLK_FILTERED_CH2:
				sClockSourceConfig.ClockSource = TIM_CLOCKSOURCE_TI2;
				break;
			case TIMER_COUNTER_CLK_FILTERED_CH1:
			default:
				sClockSourceConfig.ClockSource = TIM_CLOCKSOURCE_TI1;
				break;
			}
			HAL_TIM_ConfigClockSource(p_htim, &sClockSourceConfig);

			switch (timer_inputcap_configs[timer_index].slavemode_trigger) {
			case TIMER_SLAVE_MODE_TRIGGER_EDGEDETECT_CH1:
				sSlaveConfig.InputTrigger = TIM_TS_TI1F_ED;
				break;
			case TIMER_SLAVE_MODE_TRIGGER_FILTERED_CH2:
				sSlaveConfig.InputTrigger = TIM_TS_TI2FP2;
				break;
			case TIMER_SLAVE_MODE_TRIGGER_FILTERED_CH1:
			default:
				sSlaveConfig.InputTrigger = TIM_TS_TI1FP1;
				break;
			}

			switch (timer_inputcap_configs[timer_index].slavemode) {
			case TIMER_SLAVE_MODE_RESET:
				sSlaveConfig.SlaveMode = TIM_SLAVEMODE_RESET;
				break;
			case TIMER_SLAVE_MODE_GATED:
				sSlaveConfig.SlaveMode = TIM_SLAVEMODE_GATED;
				break;
			case TIMER_SLAVE_MODE_TRIGGER:
				sSlaveConfig.SlaveMode = TIM_SLAVEMODE_TRIGGER;
				break;
			case TIMER_SLAVE_MODE_DISABLED:
			default:
				sSlaveConfig.SlaveMode = TIM_SLAVEMODE_DISABLE;
				break;
			}
			/* ETR triggering is not supported; thus, these values are set to reasonable defaults. */
			sSlaveConfig.TriggerPolarity = TIM_INPUTCHANNELPOLARITY_RISING;
			sSlaveConfig.TriggerPrescaler = TIM_ICPSC_DIV1;
			sSlaveConfig.TriggerFilter = 0;
			HAL_TIM_SlaveConfigSynchronization(p_htim, &sSlaveConfig);

			/* Configure Timer Input Channel 1 */
			HAL_IOCX_TIMER_ConfigureInputCaptureChannel(timer_index, 0, &sConfigIC);
			HAL_TIM_IC_ConfigChannel(p_htim, &sConfigIC, TIM_CHANNEL_1);

			/* Configure Timer Input Channel 2 */
			HAL_IOCX_TIMER_ConfigureInputCaptureChannel(timer_index, 1, &sConfigIC);
			HAL_TIM_IC_ConfigChannel(p_htim, &sConfigIC, TIM_CHANNEL_2);

			/* Disable MasterSlave Mode */
			sMasterConfig.MasterOutputTrigger = TIM_TRGO_RESET;
			sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
			HAL_TIMEx_MasterConfigSynchronization(p_htim, &sMasterConfig);

			/* Start channels; first channel should generate capture interrupts */
			HAL_TIM_IC_Start_IT(p_htim, timer_configs[timer_index].first_channel_number);
			HAL_TIM_IC_Start(p_htim, timer_configs[timer_index].second_channel_number);

			HAL_IOCX_TIMER_Enable_Capture_Interrupt(timer_index,1);
		}
		break;

	default:
		return;
	}
	curr_timer_cfg[timer_index] = config;
}

void HAL_IOCX_TIMER_Set_Control(uint8_t timer_index, uint8_t* control)
{
	if ( timer_index > (IOCX_NUM_TIMERS-1) ) return;
	IOCX_TIMER_COUNTER_RESET reset = iocx_decode_timer_counter_reset(control);
	if (reset == RESET_REQUEST) {
		/* Generate a Timer Update event - which clears the counter (and prescaler counter) */
		HAL_TIM_GenerateEvent(timer_configs[timer_index].p_tim_handle, TIM_EventSource_Update);
		iocx_clear_timer_counter_reset(control);
		if (QEIntegratorEnabled(timer_index)) {
			ResetQEIntegrator(timer_index, 1 /* Enable */ );
		}
	}
}

void HAL_IOCX_TIMER_Set_Prescaler(uint8_t timer_index, uint16_t ticks_per_clock)
{
	if ( timer_index > (IOCX_NUM_TIMERS-1) ) return;
	/* If one of the 96Mhz timers, multiply ticks/clock by 2 to mimic 48Mhz timers */
	if (timer_configs[timer_index].core_clock_divider == TIM_CLOCKDIVISION_DIV1) {
		ticks_per_clock *= 2;
	}
	timer_configs[timer_index].p_tim_handle->Init.Prescaler = (uint32_t)ticks_per_clock;
}

void HAL_IOCX_TIMER_Get_Prescaler(uint8_t first_timer_index, int count, uint16_t *values)
{
	uint8_t i;
	if ( first_timer_index > (IOCX_NUM_TIMERS-1) ) return;
	if ( first_timer_index + count > IOCX_NUM_TIMERS) {
		count = IOCX_NUM_TIMERS - first_timer_index;
	}

	for ( i = first_timer_index; i < first_timer_index + count; i++ ) {
		*values++ = (uint16_t)timer_configs[i].p_tim_handle->Init.Prescaler;
	}
}

/* Gets prescaler value in microseconds */
void HAL_IOCX_TIMER_Get_Normalized_Prescaler(uint8_t timer_index, uint16_t *prescaler_normalized)
{
	*prescaler_normalized = 0;
	if ( timer_index > (IOCX_NUM_TIMERS-1) ) return;

	uint16_t raw_prescaler_value = (uint16_t)timer_configs[timer_index].p_tim_handle->Init.Prescaler;
	/* Normalize prescaler value to be based on 48Mhz clock */
	if (timer_configs[timer_index].core_clock_divider == TIM_CLOCKDIVISION_DIV1) {
		raw_prescaler_value /= 2;
	}
	*prescaler_normalized = raw_prescaler_value;
}


void HAL_IOCX_TIMER_Get_Count(uint8_t first_timer_index, int count, int32_t *values)
{
	uint8_t i;
	if ( first_timer_index > (IOCX_NUM_TIMERS-1) ) return;
	if ( first_timer_index + count > IOCX_NUM_TIMERS) {
		count = IOCX_NUM_TIMERS - first_timer_index;
	}
	for ( i = first_timer_index; i < first_timer_index + count; i++ ) {
		if (QEIntegratorEnabled(i)) {
			if (qe_curr_mode[i] == QUAD_ENCODER_MODE_1x) {
				*values++ = qe_total_count[i] >> 1; /* Divide by 2 */
			} else {
				*values++ = qe_total_count[i];
			}
		} else {
			*values++ = (int32_t)timer_configs[i].p_tim_handle->Instance->CNT;
		}
	}
}

static int HAL_IOCX_TIMER_IsCaptureInputActive(uint8_t timer_index) {
	int input_active = 0;
	if ( timer_index > (IOCX_NUM_TIMERS-1) ) return input_active;

	uint8_t timer_config = curr_timer_cfg[timer_index];
	IOCX_TIMER_MODE timer_mode = iocx_decode_timer_mode(&timer_config);
	if (timer_mode == TIMER_MODE_INPUT_CAPTURE) {
		uint32_t stall_timeout_ms = timer_inputcap_configs[timer_index].stall_timeout_ms;
		if (stall_timeout_ms == TIMER_INPUT_CH_STALL_TIMEOUT_DISABLED) {
			input_active = 1;
		} else {
			uint32_t curr_timestamp = HAL_GetTick();
			uint32_t last_capture_timestamp = timer_last_capture_interrupt_timestamp_ms[timer_index];
			uint32_t ts_delta = curr_timestamp - last_capture_timestamp;
			input_active = (ts_delta < stall_timeout_ms);
		}
	} else if (timer_mode == TIMER_MODE_QUAD_ENCODER) {
		/* Currently, Quad Encoder inputs are always considered active */
		input_active = 1;
	}
	return input_active;
}

void HAL_IOCX_TIMER_Get_Status(uint8_t first_timer_index, int count, uint8_t *values)
{
	uint8_t iTimer;
	if ( first_timer_index > (IOCX_NUM_TIMERS-1) ) return;
	if ( first_timer_index + count > IOCX_NUM_TIMERS) {
		count = IOCX_NUM_TIMERS - first_timer_index;
	}
	for ( iTimer = first_timer_index; iTimer < first_timer_index + count; iTimer++ ) {
		/* Timer Direction */
		uint32_t cr1_reg = timer_configs[iTimer].p_tim_handle->Instance->CR1;
		*values = ((cr1_reg & 0x00000010) ? 1 : 0);
		if (HAL_IOCX_TIMER_IsCaptureInputActive(iTimer)) {
			iocx_encode_timer_in_ch_activity(values, TIMER_INPUT_CH_ACTIVE);
		}
		values++;
	}
}

void HAL_IOCX_TIMER_PWM_Set_FramePeriod(uint8_t timer_index, uint16_t clocks_per_frame_period)
{
	if ( timer_index > (IOCX_NUM_TIMERS-1) ) return;
	timer_configs[timer_index].p_tim_handle->Init.Period = clocks_per_frame_period;
}

void HAL_IOCX_TIMER_PWM_Get_FramePeriod(uint8_t first_timer_index, int count, uint16_t* values)
{
	uint8_t i;
	if ( first_timer_index > (IOCX_NUM_TIMERS-1) ) return;
	if ( first_timer_index + count > IOCX_NUM_TIMERS) {
		count = IOCX_NUM_TIMERS - first_timer_index;
	}
	for ( i = first_timer_index; i < first_timer_index + count; i++ ) {
		*values++ = (uint16_t)timer_configs[i].p_tim_handle->Init.Period;
	}
}

