kauailabs/navxmxp/stm32/navx-mxp/navx-mxp_hal.c
void HAL_IOCX_TIMER_PWM_Set_DutyCycle(uint8_t timer_index, uint8_t channel_index, uint16_t clocks_per_active_period)
{
	if ( timer_index > (IOCX_NUM_TIMERS-1) ) return;
	timer_channel_ccr[timer_index][channel_index] = clocks_per_active_period;
	if (iocx_decode_timer_mode(&curr_timer_cfg[timer_index]) != TIMER_MODE_DISABLED) {
	    if (channel_index == 0) {
	        __HAL_TIM_SetCompare(timer_configs[timer_index].p_tim_handle, timer_configs[timer_index].first_channel_number, clocks_per_active_period);
	    } else {
            __HAL_TIM_SetCompare(timer_configs[timer_index].p_tim_handle, timer_configs[timer_index].second_channel_number, clocks_per_active_period);
	    }
	}
}

void HAL_IOCX_TIMER_PWM_Get_DutyCycle(uint8_t first_timer_index, uint8_t first_channel_index, int channel_count, uint16_t *values)
{
	if ( first_timer_index > (IOCX_NUM_TIMERS-1) ) return;
	if ( first_channel_index > (IOCX_NUM_CHANNELS_PER_TIMER-1) ) return;
	size_t curr_struct_index = (first_timer_index * IOCX_NUM_CHANNELS_PER_TIMER) + first_channel_index;
	size_t num_entries = (sizeof(timer_channel_ccr) / sizeof(timer_channel_ccr[0][0]));
	if ( channel_count > (num_entries - curr_struct_index) ) {
		channel_count = num_entries - curr_struct_index;
	}
	int iTimer;
	int iChannel;
	int iValueIndex = 0;
	int iChannelCount = 0;
	for ( iTimer = 0; iTimer < IOCX_NUM_TIMERS; iTimer++ ) {
		uint8_t timer_cfg = curr_timer_cfg[iTimer];
		IOCX_TIMER_MODE mode = iocx_decode_timer_mode(&timer_cfg);
		int ic_input_active = HAL_IOCX_TIMER_IsCaptureInputActive(iTimer);
		TIM_HandleTypeDef * p_htim = timer_configs[iTimer].p_tim_handle;
		for ( iChannel = 0; iChannel < IOCX_NUM_CHANNELS_PER_TIMER; iChannel++ ) {
			if (((iTimer == first_timer_index) && (iChannel >= first_channel_index)) ||
			    (iTimer > first_timer_index)) {
				TIMER_INPUT_CAPTURE_STALL_ACTION stall_action =
						timer_inputcap_configs[iTimer].stall_action;
				TIMER_INPUT_CAPTURE_CH_SOURCE source =
						timer_input_ch_configs[iTimer][iChannel].source;
				int clear_ccr_reg =
						((stall_action == TIMER_STALL_ACTION_CLEAR_COUNTER) &&
						 !ic_input_active);
				if (iChannel == 0) {
					if (mode == TIMER_MODE_INPUT_CAPTURE) {
						if (!clear_ccr_reg) {
							if (source == INPUT_CAPTURE_FROM_SIGNAL_A) {
								values[iValueIndex] = (uint16_t)p_htim->Instance->CCR1;
							} else {
								values[iValueIndex] = (uint16_t)p_htim->Instance->CCR2;
							}
						} else {
							values[iValueIndex] = 0; // No recent data received
						}
					} else {
						values[iValueIndex] = (uint16_t)p_htim->Instance->CCR1;
					}
				} else if (iChannel == 1) {
					if (mode == TIMER_MODE_INPUT_CAPTURE) {
						if (!clear_ccr_reg) {
							if (source == INPUT_CAPTURE_FROM_SIGNAL_A) {
								values[iValueIndex] = (uint16_t)p_htim->Instance->CCR2;
							} else {
								values[iValueIndex] = (uint16_t)p_htim->Instance->CCR1;
							}
						} else {
							values[iValueIndex] = 0; // No recent data received
						}
					} else {
						values[iValueIndex] = (uint16_t)p_htim->Instance->CCR2;
					}
				}
				iValueIndex++;
				iChannelCount++;
			}
			if (iChannelCount >= channel_count) {
				break;
			}
		}
	}
}
#endif

/* PWM Mode signals are generated with a frequency determined by the value  */
/* of the TIMx_ARR register and a duty cycle determined by the value of the */
/* TIMx_CCRx register                                                       */


/***************************************************************************/
/* ADC section                                                             */
/*                                                                         */
/* A single ADC with multiple channels is used.  The ADC is clocked by     */
/* PCLK2, which is configured for 96Mhz, and an internal divide-by-8       */
/* configuration yields an ADC clock rate (fADC) of 12Mhz.                 */
/*                                                                         */
/* The STM32 is a Successive-Approximation ADC, configured for 12-bit      */
/* resolution.  Each sample requires 1 clock for each bit of resolution    */
/* +3 ADC Clocks - plus a sample period.  Longer sample periods provide    */
/* more time for the input capacitor to charge and stabilize before        */
/* sampling begins.  Tests have shown longer sample periods reduce the     */
/* impact of noise, and the currently-selected sample period is 28 clocks. */
/* This yields an overall sample rate of 150Ksps, as follows:              */
/*                                                                         */
/* ADCCLK = 96Mhz / 8 = 12 Mhz                                             */
/* NumChannels = 6                                                         */
/* SamplePeriodClks = 28                                                   */
/* ResolutionClks = 15                                                     */
/* sample_rate = ADCCLK/(NumChannels * (SamplePeriodClks + ResolutionClks) */
/* sample_rate = 46.5ksps                                                  */
/***************************************************************************/
/* Input Channel Mapping:                                                  */
/* An Connector 1:  ADC1_IN9                                               */
/* An Connector 2:  ADC1_IN8                                               */
/* An Connector 3:  ADC1_IN15                                              */
/* An Connector 4:  ADC1_IN14                                              */
/* Analog Input 5V/3.3V Jumper:  ADC1_IN10                                 */
/* Ext 12VDC Battery Input:  ADC1_IN11                                     */
/***************************************************************************/
/* ADC1 is configured in scan conversion mode, scanning each channel in    */
/* order of connector number.                                              */
/* DMA Transfer of data to SRAM is used.  The DMA transfer is configured   */
/* in circular mode.  In this way, ADC data is continually transferred     */
/* into the buffer, and software can read out data from the buffer while   */
/* transfers are in progress.                                              */
/***************************************************************************/

#ifdef ENABLE_ADC
#define ADC_CLOCK_FREQUENCY 12000000
#define ADC_CLOCKS_PER_SAMPLE 43
#define ADC_NUM_CHANNELS 6
#define ADC_NUM_EXTERNAL_CHANNELS 4
#define ADC_CHANNEL_ANALOG_VOLTAGE_SWITCH 4
#define ADC_CHANNEL_EXT_POWER_VOLTAGE_DIV 5
#define INVALID_ADC_CHANNEL_NUMBER 6
/* NOTE:  The last two ADC channels are reserved for internal use; the preceding  */
/* ADC channels are user GPIOs.                                                   */
/* The next-to-last channel is the 5V vs 3.3V Analog Input Voltage measure        */
/*   (if this value is > 2.5V, then the Analog Voltage Input High Level is 5V)    */
/* The last channel measures the 12VDC input voltage (w/a voltage divider 4.45:1, */
/*   to ensure that the max voltage does not exceed 3.3V).                        */

