kauailabs/navxmxp/stm32/navx-mxp/navx-mxp_hal.c
void HAL_IOCX_ADC_AWDG_Enable(uint8_t channel)
{
#ifdef ENABLE_ADC
	if ( channel < ADC_NUM_EXTERNAL_CHANNELS ) {
		ADC_AnalogWDGConfTypeDef AnalogWDGConfig;

		/**Configure the analog watchdog
		*/
		AnalogWDGConfig.WatchdogMode = ADC_ANALOGWATCHDOG_SINGLE_REG;
		AnalogWDGConfig.HighThreshold = awdg_high_threshold;
		AnalogWDGConfig.LowThreshold = awdg_low_threshold;
		AnalogWDGConfig.Channel = adc_channels[channel];
		AnalogWDGConfig.ITMode = awdg_interrupt_enabled ? ENABLE : DISABLE;
		if(HAL_ADC_AnalogWDGConfig(&hadc1, &AnalogWDGConfig) == HAL_OK) {
			awdg_enabled = !0;
			awdg_channel = channel;
		}
	}
#endif
}

/* Returns non-zero if enabled */
int HAL_IOCX_ADC_AWDG_Is_Enabled(uint8_t* p_channel)
{
#ifdef ENABLE_ADC
	return awdg_enabled;
#else
	return 0;
#endif
}

uint16_t HAL_IOCX_ADC_AWDG_Get_Threshold_High()
{
#ifdef ENABLE_ADC
	return awdg_high_threshold;
#else
	return 0;
#endif
}

uint16_t HAL_IOCX_ADC_AWDG_Get_Threshold_Low()
{
#ifdef ENABLE_ADC
	return awdg_low_threshold;
#else
	return 0;
#endif
}

void HAL_IOCX_ADC_AWDG_Set_Threshold_High(uint16_t threshold)
{
#ifdef ENABLE_ADC
	awdg_high_threshold = threshold;
	if(awdg_enabled) {
		hadc1.Instance->HTR = threshold;
	}
#endif
}

void HAL_IOCX_ADC_AWDG_Set_Threshold_Low(uint16_t threshold)
{
#ifdef ENABLE_ADC
	awdg_low_threshold = threshold;
	if(awdg_enabled) {
		hadc1.Instance->LTR = threshold;
	}
#endif
}

int HAL_IOCX_ADC_AWDG_Get_Interrupt_Enable()
{
#ifdef ENABLE_ADC
	return awdg_interrupt_enabled;
#else
	return 0;
#endif
}

void HAL_IOCX_ADC_AWDG_Set_Interrupt_Enable(int enable)
{
#ifdef ENABLE_ADC
	awdg_interrupt_enabled = enable;
	if(awdg_enabled) {
	/* Enable the ADC Analog watchdog interrupt */
		__HAL_ADC_ENABLE_IT(&hadc1, ADC_IT_AWD);
	} else {
	/* Disable the ADC Analog watchdog interrupt */
		__HAL_ADC_DISABLE_IT(&hadc1, ADC_IT_AWD);
	}
#endif
}

